In [1]:
# Q1. List any five functions of the pandas library with execution.

read_csv(): This function is used to read data from a CSV file and create a DataFrame.

In [3]:
import pandas as pd

df=pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [4]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

head(): The head() function is used to display the first n rows of a DataFrame. By default, it displays the first 5 rows.m

In [6]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

groupby(): This function is used to group the rows of a DataFrame based on a specified column and perform aggregate functions on them.

In [13]:
sex=df.groupby("Sex").sum()

/tmp/ipykernel_77/118287038.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  sex=df.groupby("Sex").sum()

In [14]:
sex

        PassengerId  Survived  Pclass       Age  SibSp  Parch        Fare
Sex
female       135343       233     678   7286.00    218    204  13966.6628
male         262043       109    1379  13919.17    248    136  14727.2865

merge(): The merge() function is used to combine two DataFrames based on a common column or index.

In [15]:
import pandas as pd

# Create two DataFrames
data1 = {'ID': [1, 2, 3],
         'Name': ['Alice', 'Bob', 'Charlie']}
df1 = pd.DataFrame(data1)

data2 = {'ID': [2, 3, 4],
         'Salary': [60000, 55000, 70000]}
df2 = pd.DataFrame(data2)

# Merge DataFrames based on 'ID' column
merged = pd.merge(df1, df2, on='ID')
merged

   ID     Name  Salary
0   2      Bob   60000
1   3  Charlie   55000

pivot_table(): This function is used to create a pivot table from a DataFrame, allowing you to summarize and analyze data.

In [16]:
data = {'Date': ['2023-01-01', '2023-01-01', '2023-01-02', '2023-01-02'],
        'Category': ['A', 'B', 'A', 'B'],
        'Sales': [100, 150, 200, 120]}
df = pd.DataFrame(data)
df

         Date Category  Sales
0  2023-01-01        A    100
1  2023-01-01        B    150
2  2023-01-02        A    200
3  2023-01-02        B    120

In [17]:
pivot = df.pivot_table(index='Date', columns='Category', values='Sales', aggfunc='sum')
pivot

Category      A    B
Date
2023-01-01  100  150
2023-01-02  200  120

In [18]:
#2 Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
#DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [19]:
import pandas as pd

data={"A":[ 10,20,30],
      "B":[ 40,50,60],
      "C":[ 70,80,90],
}

df=pd.DataFrame(data)

In [20]:
df

    A   B   C
0  10  40  70
1  20  50  80
2  30  60  90

In [27]:
def re_index_data(df):
    new_index=range(1,len(df)*2+1,2)
    df_reindex=df.copy()
    df_reindex.index=(new_index)
    return df_reindex
import pandas as pd

data={"A":[ 10,20,30],
      "B":[ 40,50,60],
      "C":[ 70,80,90],
}

df=pd.DataFrame(data)

re=re_index_data(df)
print(re)

    A   B   C
1  10  40  70
3  20  50  80
5  30  60  90

In [28]:
#Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
#iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
#function should print the sum to the console.

In [30]:
import pandas as pd
def sum_of_three_value(df):
    if "Values" in df.columns:
        value_columns=df["Values"]
        sum_value_three=value_columns.head(3).sum()
        print("the of first three value is - ",sum_value_three)
    else:
        print("columns not found in dataframe ")
        
        
data={"Values":[1,2,3,6,5,8,9]}
df=pd.DataFrame(data)
sum_of_three_value(df)

the of first three value is -  6

In [31]:
#Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
#'Word_Count' that contains the number of words in each row of the 'Text' column.

In [33]:
import pandas as pd

def word_count(df):
    if "Text" in df.columns:
        
        df['Word_Count'] = df['Text'].apply(lambda x: len(str(x).split()))
    else:
        print("no column found name text")

data={"Text":["shri ram","sandeep saini","ram shyam ji"]
}
df=pd.DataFrame(data)
word_count(df)
df

            Text  Word_Count
0       shri ram           2
1  sandeep saini           2
2   ram shyam ji           3

In [34]:
#Q5. How are DataFrame.size() and DataFrame.shape() different?

DataFrame.size():
The DataFrame.size() method returns the total number of elements in the DataFrame, which is equal to the number of rows multiplied by the number of columns.

Example:

In [38]:
import pandas as pd

data={"A":[10,20,30],
      "B":[20,30,40,],
      "C":[40,50,60]
     }
df=pd.DataFrame(data)
df
dataframe_size=df.size
dataframe_size

9

DataFrame.shape():
The DataFrame.shape() attribute returns a tuple representing the dimensions of the DataFrame. It contains two values: the number of rows and the number of columns.

Example:

In [39]:
import pandas as pd

data={"A":[10,20,30],
      "B":[20,30,40,],
      "C":[40,50,60]
     }
df=pd.DataFrame(data)
rows, columns = df.shape
print("Number of rows:", rows)
print("Number of columns:", columns)

Number of rows: 3
Number of columns: 3

In [40]:
#Q6. Which function of pandas do we use to read an excel file?

n the Pandas library of Python, you can use the read_excel() function to read data from an Excel file. This function allows you to specify the file path and other optional parameters to customize the reading process, such as specifying the sheet name or index, skipping rows, and more.

In [41]:
#Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
#addresses in the format 'username@domain.com'. Write a Python function that creates a new column
#'Username' in df that contains only the username part of each email address.

In [3]:
import pandas as pd

def extract_username(df):
    if "Email" in df.columns:
        df["username"]=df["Email"].apply(lambda x: str(x).split("@")[0])
    else:
        print("Email column is not avaliable")
        
data={"Email":["sandeep@gmail.com","pwsill@pwskill.com"]
}
df=pd.DataFrame(data)
extract_username(df)
df

                Email username
0   sandeep@gmail.com  sandeep
1  pwsill@pwskill.com   pwsill

In [4]:
#Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
#all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
#function should return a new DataFrame that contains only the selected rows.

In [9]:
import pandas as pd

def extract_row(df):
    select_rows=df[(df["A"]>5) & (df["B"]<10)]
    return select_rows

data={"A":[3,8,6,2,9],
      "B":[5,2,9,3,1],
      "C":[1,7,4,5,2]
}
df=pd.DataFrame(data)
extract_row(df)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [10]:
#Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
#median, and standard deviation of the values in the 'Values' column.

In [25]:
import pandas as pd

def calculate_value(df):
    values_column=df["Value"]
    mean=values_column.mean()
    median=values_column.median()
    std_deviation=values_column.std()
    return mean, median, std_deviation
    
data={"Value" : [10, 15, 20, 25, 30]}
df=pd.DataFrame(data)
calculate_value(df)
print("Mean:", mean)
print("Median:", median)
print("Standard Deviation:", std)

Mean: 30.0
Median: 30.0
Standard Deviation: 15.811388300841896

In [26]:
#Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
#create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
#for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
#should include the current day.

In [29]:
import pandas as pd

def moving_average(df):
    df["MovingAverage"]=df["Sales"].rolling(window=7,min_periods=1).mean()
    
data = {'Date': ['2023-08-01', '2023-08-02', '2023-08-03', '2023-08-04', '2023-08-05', '2023-08-06', '2023-08-07'],
        'Sales': [100, 120, 130, 110, 150, 140, 160]}
df=pd.DataFrame(data)
df["Date"]=pd.to_datetime(df["Date"])
moving_average(df)
df

        Date  Sales  MovingAverage
0 2023-08-01    100     100.000000
1 2023-08-02    120     110.000000
2 2023-08-03    130     116.666667
3 2023-08-04    110     115.000000
4 2023-08-05    150     122.000000
5 2023-08-06    140     125.000000
6 2023-08-07    160     130.000000

In [30]:
#Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
#column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
#Monday, Tuesday) corresponding to each date in the 'Date' column.

In [31]:
import pandas as pd

def weekday(df):
    df["Weakday"]=df["Date"].dt.day_name()
    return df
data = {'Date': ['2023-08-21', '2023-08-22', '2023-08-23']}
df=pd.DataFrame(data)
df["Date"]=pd.to_datetime(df["Date"])
weekday(df)

        Date    Weakday
0 2023-08-21     Monday
1 2023-08-22    Tuesday
2 2023-08-23  Wednesday

In [33]:
#Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
#function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [35]:
import pandas as pd

def select_rows_between_dates(df):
    start_date = '2023-01-01'
    end_date = '2023-01-31'
    
    # Convert 'Date' column to datetime format
    df['Date'] = pd.to_datetime(df['Date'])
    
    # Select rows within the specified date range
    selected_rows = df[(df['Date'] >= start_date) & (df['Date'] <= end_date)]
    
    return selected_rows

# Example usage
data = {'Date': ['2023-01-15', '2023-01-20', '2023-02-10', '2023-01-05']}
df = pd.DataFrame(data)
selected_rows = select_rows_between_dates(df)
print(selected_rows)

        Date
0 2023-01-15
1 2023-01-20
3 2023-01-05

In [38]:
import pandas as pd

def select_row(df):
    start_date="2023-01-01"
    end_date="2023-01-31"
    
    df["Date"]=pd.to_datetime(df["Date"])
    
    select_rows= df[(df["Date"]>=start_date) & (df["Date"]<=end_date)]
    return select_rows

data = {'Date': ['2023-01-15', '2023-01-20', '2023-02-10', '2023-01-05','2023-02-04']}

df=pd.DataFrame(data)
select_row(df)

        Date
0 2023-01-15
1 2023-01-20
3 2023-01-05

In [39]:
#Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
#be imported?

To utilize the fundamental functionalities of pandas, the primary library that needs to be imported is the pandas library itself. You can do this by using the following import statement:

In [40]:
import pandas as pd